# coding: utf-8
from collections import OrderedDict

sizes = OrderedDict([
    (u'主卧', (3680*3200 + (3680/2)*500) / (1000*1000.0)),
    (u'次卧', 2350*3200  / (1000*1000.0)),
    (u'客厅', (1800+2350+2000)*(950+2449)  / (1000*1000.0)),
    (u'卫生间', 3537*1800  / (1000*1000.0)),
    (u'厨房', (2350+1800+60)*1500  / (1000*1000.0)),
    (u'阳台', (1840*3800 / (1000*1000.0))),
    (u'墙砖', ((2350+1800+60)*2800 + 3537*2800*2 + 1800*2800*2 + 1840*2800) / (1000*1000.0)),
])

#cabinet_size = (3200 * 2800) / (1000*1000.0) # 衣柜面积
cabinet_size = (1840 * 2800) / (1000*1000.0) # 衣柜面积
cabinet_price = 900

prices = OrderedDict({
    u'地板': 135,   # 扬子木地板团购价
    #u'地砖': 140 * (1000*1000) / (800*800),   # 中档偏上
    u'地砖': 80 * (1000*1000) / (800*800),   # 普通
    #u'墙砖': (10*(1000*1000)/(300*300)),       # 中档偏上
    #u'防滑地砖': (10*(1000*1000)/(300*300)),   # 中档偏上
    u'墙砖': (7*(1000*1000)/(300*300)),        # 普通
    u'防滑地砖': (5*(1000*1000)/(300*300)),    # 普通
})

print u'面积'
for k,v in sizes.items():
    print k, v, u'平'
print

majors_totals = OrderedDict([
    (u'门', 3000+800*3),
    (u'客厅地砖', prices[u'地砖'] * sizes[u'客厅']),
    (u'房间地板', prices[u'地板'] * (sizes[u'主卧'] + sizes[u'次卧'])),
    (u'防滑地砖', (sizes[u'卫生间'] + sizes[u'厨房'] + sizes[u'阳台']) * prices[u'防滑地砖']),
    (u'墙砖', sizes[u'墙砖']*prices[u'墙砖']),
    (u'衣柜', cabinet_size*cabinet_price),
    (u'整体橱柜+厨房电器', 10000),
    (u'卫浴', 5000),
    (u'热水器', 3000),
    (u'电视/音响', 10000),
    (u'沙发', 6000),
    (u'主卧床', 2000),
    (u'床垫', 2000),
    (u'灯具', 2000),
    (u'空调', 2000),
    (u'封阳台', 5000),
    (u'餐桌', 2000),
])

print u'主材总价：'
for k, v in majors_totals.items():
    print k, v
print

print u'合计：', sum(majors_totals.values())
